Revit 2027 API
BuiltInFailures.SketchFailures.InvalidProfileError Property
 One or more profiles are invalid. Make sure that every used profile is a closed loop of non-intersecting lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidProfileError { get; }
Public Shared ReadOnly Property InvalidProfileError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidProfileError {
	FailureDefinitionId^ get ();
}
static member InvalidProfileError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace